app/Helpers/my_helper.php

function getPendapatanHariIni()
{
    $orderModel = new OrderModel();

    $pendapatan = $orderModel
        ->selectSum('total_harga', 'pendapatan')
        ->where('DATE(created_at)', date('Y-m-d'))
        ->where('paid', 1)
        ->first();
---
SELECT SUM(`total_harga`) AS `pendapatan`
FROM `orders`
WHERE DATE(created_at) = '2025-06-19'
AND `paid` = 1
 LIMIT 1

function getPersenPendapatanHariIni($target = 1000000)
{
    $orderModel = new OrderModel();

    $pendapatan = $orderModel
        ->selectSum('total_harga', 'pendapatan')
        ->where('DATE(created_at)', date('Y-m-d'))
        ->where('paid', 1)
        ->first();
---
SELECT SUM(`total_harga`) AS `pendapatan`
FROM `orders`
WHERE DATE(created_at) = '2025-06-19'
AND `paid` = 1
 LIMIT 1

function getPendapatan()
{
    $orderModel = new OrderModel();

    $pendapatan = $orderModel
        ->selectSum('total_harga', 'pendapatan')
        ->where('paid', 1)
        ->first();
---
SELECT SUM(`total_harga`) AS `pendapatan`
FROM `orders`
WHERE `paid` = 1
 LIMIT 1

function getPersenPendapatan($target = 1000000)
{
    $orderModel = new OrderModel();

    $pendapatan = $orderModel
        ->selectSum('total_harga', 'pendapatan')
        ->where('paid', 1)
        ->first();
---
SELECT SUM(`total_harga`) AS `pendapatan`
FROM `orders`
WHERE `paid` = 1
 LIMIT 1

    function getNewUsersToday()
    {
        $userModel = new UserModel();

        return $userModel
            ->where('DATE(created_at)', date('Y-m-d'))
            ->countAllResults(); // ✅ hitung jumlah user hari ini
---
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE DATE(created_at) = '2025-06-19'