app/Controllers/ChartController.php

SELECT MONTH(created_at) as bulan, SUM(total_harga) as total
FROM `orders`
GROUP BY MONTH(created_at)
ORDER BY `bulan`
SELECT MONTH(created_at) as bulan, COUNT(*) as jumlah_order
FROM `orders`
GROUP BY MONTH(created_at)
ORDER BY `bulan`
SELECT MONTH(created_at) as bulan, COUNT(*) as complete_laundry
FROM `orders`
WHERE `status` = 'Selesai'
GROUP BY MONTH(created_at)
ORDER BY `bulan`
---
    public function salesData()
    {
        if (!session()->get('logged_in_admin')) {
            return redirect()->back();
        }
        $orderModel = new OrderModel();

        // Ambil data penjualan per bulan (contoh)
        $data = $orderModel->select("MONTH(created_at) as bulan, SUM(total_harga) as total")
            ->groupBy("MONTH(created_at)")
            ->orderBy("bulan")
            ->findAll();

        $data2 = $orderModel
            ->select("MONTH(created_at) as bulan, COUNT(*) as jumlah_order")
            ->groupBy("MONTH(created_at)")
            ->orderBy("bulan")
            ->get()
            ->getResultArray();

        $data3 = $orderModel
            ->select("MONTH(created_at) as bulan, COUNT(*) as complete_laundry")
            ->where('status', 'Selesai')
            ->groupBy("MONTH(created_at)")
            ->orderBy("bulan")
            ->get()
            ->getResultArray();

SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `last_activity` >= '2025-06-19 07:38:53'
AND `last_activity` < '2025-06-19 07:43:53'
AND `role` = 'customer'
---
    public function userData()
    {
        $userModel = new UserModel();
        $data = [];

        for ($i = 6; $i >= 0; $i--) {
            $timeStart = date('Y-m-d H:i:s', strtotime("-" . ($i + 1) * 5 . " minutes"));
            $timeEnd = date('Y-m-d H:i:s', strtotime("-" . $i * 5 . " minutes"));

            $count = $userModel
                ->where('last_activity >=', $timeStart)
                ->where('last_activity <', $timeEnd)
                ->where('role', 'customer')
                ->countAllResults();