app/Controllers/DashboardController.php

SELECT *
FROM `users`
WHERE `created_at` >= '2025-06-19 00:00:00'
AND `created_at` <= '2025-06-19 23:59:59'
ORDER BY `created_at` DESC
SELECT *
FROM `orders`
WHERE `paid` = 1
AND `created_at` >= '2025-06-19 00:00:00'
AND `created_at` <= '2025-06-19 23:59:59'
ORDER BY `created_at` DESC
---

        $data = [
            'title' => 'Dashboard',
            'users' => $userModel
                ->where('created_at >=', $today . ' 00:00:00')
                ->where('created_at <=', $today . ' 23:59:59')
                ->orderBy('created_at', 'DESC') // <-- Ini penting untuk paling baru
                ->findAll(),
            'orders' => $orderModel
                ->where('paid', 1)
                ->where('created_at >=', $today . ' 00:00:00')
                ->where('created_at <=', $today . ' 23:59:59')
                ->orderBy('created_at', 'DESC') // opsional
                ->findAll(),