app/Controllers/OrderAdminController.php

    public function index()
    {
        if (!session()->get('logged_in_admin')) {
            return redirect()->back();
        }
        helper('my');
        $result = $this->orderModel->findAll();
---
SELECT *
FROM `orders`