app/Controllers/UsersController.php

    public function index()
    {
        $result = $this->userModel->findAll();
---
SELECT *
FROM `users`