app/Models/OrderModel.php

SELECT DATE(created_at) as tanggal, SUM(total_harga) as total
FROM `orders`
WHERE `created_at` >= '2025-06-13'
AND `paid` = 1
GROUP BY DATE(created_at)
---
    public function getPendapatanPerHari7HariTerakhir()
    {
        $builder = $this->db->table('orders');
        $builder->select("DATE(created_at) as tanggal, SUM(total_harga) as total");
        $builder->where('created_at >=', date('Y-m-d', strtotime('-6 days')));
        $builder->where('paid', 1);
        $builder->groupBy('DATE(created_at)');
        $query = $builder->get();